Revit 2027 API
BuiltInFailures.ImportExportFailures Class
 Failures about Import and Export.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.ImportExportFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class ImportExportFailures
Public NotInheritable Class ImportExportFailures
public ref class ImportExportFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ImportExportFailures = class end
The BuiltInFailures.ImportExportFailures type exposes the following members.
Properties
Name | Description
ViewBoundariesTooLarge |  The view boundaries are too large to export the view..
Top
See Also
Reference
Autodesk.Revit.DB Namespace